Autodesk.Revit.DB.Structure.LineLoad.SetCurve(Autodesk.Revit.DB.Curve)
Sets the curve for the line load.
Remarks:
The curve must be bounded.
The curve can be:
Line Arc Ellipse
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The provided curve is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This LineLoad is not a hosted object.
-or-
This LineLoad is constrained on host.
Since:
2024

Autodesk.Revit.DB.Structure.LineLoad.SetPoints(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Sets start and end point of the line load.
Remarks:
This method works with hosted line load only.
This method works for loads which are not constrained to their host.
The curve of the resulted load will be a line.
startPoint:
The start point.
endPoint:
The end point.
Returns:
Returns true if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the end point is equal to the start point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This LineLoad is not a hosted object.
-or-
This LineLoad is constrained on host.
Since:
2016

Autodesk.Revit.DB.Structure.LineLoad.IsValidHostId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the provided host id can host line loads.
doc:
The document containing both the host and the load.
hostId:
The id of the analytical element that is about to host a line load.
Returns:
True if a line load can be placed on the input host id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new custom line load within the project.
Remarks:
The curve must be bounded.
The curve can be:
Line Arc Ellipse
document:
Document to which new line load will be added.
hostElemId:
The analytical host element for the line Load.
curve:
Curve of the line load.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
-or-
The provided curve is not supported.
-or-
The input curve is not bound.
-or-
hostElemId is not a valid host for line load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2024

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new hosted line load within the project.
document:
Document to which new line load will be added.
hostElemId:
The analytical host element for the line Load.
curveIndex:
The index of a curve in analytical surface element starting from 0.
Use Autodesk::Revit::DB::Structure::AnalyticalSurfaceBase::GetOuterContour method to obtain appropriate curve index.
Curve index has a unique value in analytical element. The index should be obtain by iteration through all curves in all loops.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
-or-
hostElemId is not a valid host for line load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2023

Autodesk.Revit.DB.Structure.LineLoad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Structure.LineLoadType)
Creates a new hosted line load within the project.
document:
Document to which new line load will be added.
hostElemId:
The analytical host element for the line Load.
forceVector1:
The applied 3d force vector.
momentVector1:
The applied 3d moment vector.
symbol:
The symbol of the LineLoad. Set null to use default type.
Returns:
If successful, returns the newly created LineLoad, null otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElemId does not exist in the document
-or-
hostElemId is not permitted for this type of load.
-or-
hostElemId is not a valid host for line load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when all force and moment vectors are equal zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if type could not be set for newly created line load.
Since:
2023